src/app/controllers/posts_controller.rb

    def update
        if @post.update(post_params)
---
UPDATE "posts" SET "title" = ?, "content" = ?, "updated_at" = ? WHERE "posts"."id" = ?  [["title", "update"], ["content", "ssss"], ["updated_at", "2024-03-03 18:34:16.756197"], ["id", 1]]